[
    {
      "company": "TECHTRIX",
      "address": "848 Ryerson Street, Florence, California, 9066",
      "about": "Are you a self-motivated engineering manager with a passion for designing and developing software solutions? Our Vancouver client is seeking to hire a Software Platform Engineering Manager, on a permanent full-time basis. Apply to this amazing Software Platform Engineering Manager opportunity today!

      What’s in it for you!
      • Leading market annual rates.
      • Comprehensive benefits package.
      • Permanent full-tine position.
      • Flexible schedule: option for partial remote work.
      • Fun/modern work culture.
      
      What you’ll be doing?
      As a Software Platform Engineering Manager with our Vancouver client, you will:
      • Hire, mentor, and coach software engineers.
      • Manage projects from design to release.
      • Commit code to production (Ruby and/or Coldfusion).
      • Dive into current Coldfusion stack in to gain an understanding of our current system.
      • Work closely with product and the team to prioritize stories, get them estimated, scheduled for sprints, and keep them on track for delivery.
      • Collaborate with other engineering teams to plan upcoming projects, coordinate with operations and support infrastructure teams to ensure delivery of new project goes out smoothly.
      
      How do you qualify?
      • 10+ years’ experience building software.
      • 5+ years’ experience developing services within a distributed architecture.
      • 3-5 years’ experience with Ruby, Node, Angular, Serverless Lambda, Coldfusion and AWS.
      • 2-3 years’ experience with MSSQL, Aurora.
      • 2+ years’ experience as an Engineering Manager overseeing a team.
      • Experience managing engineers building distributed architectures.
      • Experience managing teams of 5 or more.
      • Experience with agile an asset.
      • Experience with ecommerce standards and practices an asset.
      
      If the prospect of working with high-performing and collaborative cross-functional teams, building modern e-commerce software intrigues you, then the Software Platform Engineering Manager role could be the perfect opportunity for you! Please contact Leo Karlovskiy with your resume at:
      leo.karlovskiy@randstad.ca
      For more information, or click the Apply button now!
      "
    },
    {
      "company": "ECLIPSENT",
      "address": "522 Forrest Street, Ola, Indiana, 1951",
      "about": "A valid government security clearance;
      Ten (10) years of experience as a Programmer/Software Developer;
      Experience in systems/applications maintenance and/or development using Microsoft.NET and Oracle technologies;
      Minimum 10 years experience in the maintenance and upgrade of existing and/or legacy systems/applications;
      Experience leading a minimum of two (2) impartial Web based maintenance and/or development projects within the last five (5) years;
      Minimum two (2) years of experience maintaining, providing user support or pulling reports from the following legacy technologies: VisualDbase5/7, Dbase4/Clipper;
      Minimum one (1) year of experience in maintenance upgrades and/or the development of systems/applications in a Virtual Desktop environment;
      Minimum 10 years of experience in working with clients to establish systems/applications upgrade and maintenance requirements;
      Experience in user acceptance testing for maintenance upgrades and/or the development of systems/applications;
      Minimum 10 years of experience developing/pulling reports using Crystal reports or other technologies; and
      Experience in the maintenance of systems/applications and/or development of two (2) projects for a Federal Government Department.
      Candidate should have the following demonstrated experience:
      
      Experience as the Sole/Lead developer for the maintenance and/or development of systems/applications;
      Experience in web based systems/applications maintenance and/or development;
      Experience maintaining liaison with staff to communicate and anticipate all upgrade needs; and
      Experience developing documentation relative to system/applications upgrades or maintenance including but not limited to flow charts, reports, diagrams and test instructions."
    },
    {
      "company": "GORGANIC",
      "address": "929 Central Avenue, Katonah, Oregon, 759",
      "about": "BS or MS in Computer Science or equivalent degree
      5+ years of software development experience
      Proficiency in Entity Framework and code first design.
      Proficient in ASP.NET as well as ASP.NET MVC web frameworks
      Experienced with C#, Javascript, JQuery, AJAX, HTML, and CSS
      Development experience in an enterprise-class system with multi-tier architecture
      Must have .NET Web application architecture, design, & development experience
      Broad experience with .NET Framework 3.5 or above including WPF, WCF, & WF
      Expert in ASP.NET MVC, Web Forms, & Entity Framework
      Expert in ADO.NET / WFC Data Services and familiar with LINQ
      Expert with Design patterns, SOA design & web service development
      Strong experience in developing for high-availability clustered environments
      Working knowledge of Windows
      Strong communication and writing skills
      Comfortable working in a flexible Agile development environment
      Should be able to write reports using various reports generation tools and languages
      Expert knowledge of SQL statements
      Prior experience in the insurance industry is a plus Microsoft certifications desirable"
    }
  ]